mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_dual_bank.c
    // Doing a SoftDevice update thus current application must be cleared to ensure enough space
    // for new SoftDevice.
    m_dfu_state = DFU_STATE_PREPARING;

    if ( is_ota() )
    {
        uint32_t err_code;
        while(1) {
            err_code = pstorage_clear(&m_storage_handle_app, m_image_size);
            if (err_code != NRF_ERROR_NO_MEM)
                break;
            // No space, wait until an entry in the queue is freed
            while (NRF_ERROR_NOT_FOUND != proc_soc()) {
                // nothing
            }
        }
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        flash_nrf5x_erase(DFU_BANK_0_REGION_START, m_image_size);

        // invoke complete callback
        pstorage_callback_handler(&m_storage_handle_app, PSTORAGE_CLEAR_OP_CODE, NRF_SUCCESS, NULL, 0);
    }
}


/**@brief   Function for preparing swap before receiving application or bootloader image.
 *
 * @details This function will erase current swap area to ensure flash is ready for storage of the
 *          Application or Bootloader image. Upon erase complete a callback will be done.
 *          See \ref dfu_bank_prepare_t for further details.
 */
static void dfu_prepare_func_swap_erase(uint32_t image_size)
{
    mp_storage_handle_active = &m_storage_handle_swap;

    m_dfu_state = DFU_STATE_PREPARING;

    if ( is_ota() )
    {
        uint32_t err_code;
        while(1) {
            err_code = pstorage_clear(&m_storage_handle_swap, image_size);
            if (err_code != NRF_ERROR_NO_MEM)
                break;
            // No space, wait until an entry in the queue is freed
            while (NRF_ERROR_NOT_FOUND != proc_soc()) {
                // nothing
            }
        }
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        flash_nrf5x_erase(DFU_BANK_1_REGION_START, image_size);

        // invoke complete callback
        pstorage_callback_handler(&m_storage_handle_swap, PSTORAGE_CLEAR_OP_CODE, NRF_SUCCESS, NULL, 0);
    }
}


/**@brief   Function for handling behaviour when clear operation has completed.
 */
static void dfu_cleared_func_swap(void)
{
    // Do nothing.
}


/**@brief   Function for handling behaviour when clear operation has completed.
 */
static void dfu_cleared_func_app(void)
{
    dfu_update_status_t update_status = { 0 };
    update_status.status_code = DFU_BANK_0_ERASED;
    bootloader_dfu_update_process(update_status);
}


/**@brief   Function for calculating storage offset for receiving SoftDevice image.
 *
 * @details When a new SoftDevice is received it will be temporary stored in flash before moved to
 *          address 0x0. In order to successfully validate transfer and relocation it is important
 *          that temporary image and final installed image does not overlap hence an offset must
 *          be calculated in case new image is larger than currently installed SoftDevice.
 */
uint32_t offset_calculate(uint32_t sd_image_size)
{
    uint32_t offset = 0;

    if (m_start_packet.sd_image_size > DFU_BANK_0_REGION_START)
    {
        uint32_t page_mask = (CODE_PAGE_SIZE - 1);
        uint32_t diff = m_start_packet.sd_image_size - DFU_BANK_0_REGION_START;

        offset = diff & ~page_mask;

        // Align offset to next page if image size is not page sized.
        if ((diff & page_mask) > 0)
        {
            offset += CODE_PAGE_SIZE;
        }
    }

    return offset;
}


/**@brief Function for activating received SoftDevice image.
 *
 *  @note This function will not move the SoftDevice image.
 *        The bootloader settings will be marked as SoftDevice update complete and the swapping of
 *        current SoftDevice will occur after system reset.
 *
 * @return NRF_SUCCESS on success.
 */
static uint32_t dfu_activate_sd(void)
{
    dfu_update_status_t update_status = {0};

    update_status.status_code    = DFU_UPDATE_SD_COMPLETE;
    update_status.app_crc        = m_image_crc;
    update_status.sd_image_start = DFU_BANK_0_REGION_START;
    update_status.sd_size        = m_start_packet.sd_image_size;
    update_status.bl_size        = m_start_packet.bl_image_size;
    update_status.app_size       = m_start_packet.app_image_size;

    bootloader_dfu_update_process(update_status);

    return NRF_SUCCESS;
}


/**@brief Function for activating received Application image.
 *
 *  @details This function will move the received application image from swap (bank 1) to
 *           application area (bank 0).
 *
 * @return NRF_SUCCESS on success. Error code otherwise.
 */
static uint32_t dfu_activate_app(void)
{
    uint32_t err_code = NRF_SUCCESS;

    // Erase BANK 0.
    if ( is_ota() )
    {
        while(1) {
            err_code = pstorage_clear(&m_storage_handle_app, m_start_packet.app_image_size);
            if (err_code != NRF_ERROR_NO_MEM)
                break;
            // No space, wait until an entry in the queue is freed
            while (NRF_ERROR_NOT_FOUND != proc_soc()) {
                // nothing
            }
        }
        APP_ERROR_CHECK(err_code);

        while(1) {
            err_code = pstorage_store(&m_storage_handle_app,
                                          (uint8_t *)m_storage_handle_swap.block_id,
                                          m_start_packet.app_image_size,
                                          0);

            if (err_code != NRF_ERROR_NO_MEM)
                break;
            // No space, wait until an entry in the queue is freed
            while (NRF_ERROR_NOT_FOUND != proc_soc()) {
                // nothing
            }
        }
        VERIFY_SUCCESS(err_code);

    }
    else
    {
        flash_nrf5x_erase(DFU_BANK_0_REGION_START, m_start_packet.app_image_size);
        pstorage_callback_handler(&m_storage_handle_app, PSTORAGE_CLEAR_OP_CODE, NRF_SUCCESS, NULL, 0);

        flash_nrf5x_write(DFU_BANK_0_REGION_START, (uint8_t *)DFU_BANK_1_REGION_START, m_start_packet.app_image_size, false);
        flash_nrf5x_flush(false);
        pstorage_callback_handler(&m_storage_handle_app, PSTORAGE_STORE_OP_CODE, NRF_SUCCESS, (uint8_t *) DFU_BANK_1_REGION_START, m_start_packet.app_image_size);
    }

    if (err_code == NRF_SUCCESS)
    {
        dfu_update_status_t update_status = { 0 };

        memset(&update_status, 0, sizeof(dfu_update_status_t ));
        update_status.status_code = DFU_UPDATE_APP_COMPLETE;
        update_status.app_crc     = m_image_crc;
        update_status.app_size    = m_start_packet.app_image_size;

        bootloader_dfu_update_process(update_status);
    }

    return err_code;
}


