mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_dual_bank.c
/**@brief Function for activating received Bootloader image.
 *
 *  @note This function will not move the bootloader image.
 *        The bootloader settings will be marked as Bootloader update complete and the swapping of
 *        current bootloader will occur after system reset.
 *
 * @return NRF_SUCCESS on success.
 */
static uint32_t dfu_activate_bl(void)
{
    dfu_update_status_t update_status = {0};

    update_status.status_code = DFU_UPDATE_BOOT_COMPLETE;
    update_status.app_crc     = m_image_crc;
    update_status.sd_size     = m_start_packet.sd_image_size;
    update_status.bl_size     = m_start_packet.bl_image_size;
    update_status.app_size    = m_start_packet.app_image_size;

    bootloader_dfu_update_process(update_status);

    return NRF_SUCCESS;
}


uint32_t dfu_init(void)
{
    uint32_t                err_code;
    pstorage_module_param_t storage_module_param = {.cb = pstorage_callback_handler};

    m_init_packet_length = 0;
    m_image_crc          = 0;

    err_code = pstorage_register(&storage_module_param, &m_storage_handle_app);
    if (err_code != NRF_SUCCESS)
    {
        m_dfu_state = DFU_STATE_INIT_ERROR;
        return err_code;
    }

    m_storage_handle_app.block_id  = DFU_BANK_0_REGION_START;
    m_storage_handle_swap          = m_storage_handle_app;
    m_storage_handle_swap.block_id = DFU_BANK_1_REGION_START;

    // Create the timer to monitor the activity by the peer doing the firmware update.
    err_code = app_timer_create(&m_dfu_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                dfu_timeout_handler);
    APP_ERROR_CHECK(err_code);

    // Start the DFU timer.
    err_code = app_timer_start(m_dfu_timer_id, DFU_TIMEOUT_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    m_data_received = 0;
    m_dfu_state     = DFU_STATE_IDLE;

    return NRF_SUCCESS;
}


void dfu_register_callback(dfu_callback_t callback_handler)
{
    m_data_pkt_cb = callback_handler;
}


uint32_t dfu_start_pkt_handle(dfu_update_packet_t * p_packet)
{
    uint32_t err_code;

    if (DFU_STATE_IDLE != m_dfu_state)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    m_start_packet = *(p_packet->params.start_packet);

    const uint8_t populated_mode =
        (m_start_packet.sd_image_size ? DFU_UPDATE_SD : 0) |
        (m_start_packet.bl_image_size ? DFU_UPDATE_BL : 0) |
        (m_start_packet.app_image_size ? DFU_UPDATE_APP : 0);

    // Valid modes are SD (1), BL (2), SD+BL (3), and APP (4). Selected
    // components must be non-empty and unselected components must be empty.
    if ((m_start_packet.dfu_update_mode != populated_mode) ||
        (populated_mode == 0) || (populated_mode > DFU_UPDATE_APP))
    {
        return NRF_ERROR_NOT_SUPPORTED;
    }

    if (!(IS_WORD_SIZED(m_start_packet.sd_image_size) &&
          IS_WORD_SIZED(m_start_packet.bl_image_size) &&
          IS_WORD_SIZED(m_start_packet.app_image_size)))
    {
        // Image_sizes are not a multiple of 4 (word size).
        return NRF_ERROR_NOT_SUPPORTED;
    }

    // Bound every untrusted component before adding them. Checking only the
    // wrapped uint32_t total lets oversized SD+BL start packets bypass the
    // flash-region limit and persist impossible swap geometry in settings.
    if (m_start_packet.bl_image_size > DFU_BL_IMAGE_MAX_SIZE ||
        m_start_packet.sd_image_size > DFU_IMAGE_MAX_SIZE_FULL - m_start_packet.bl_image_size ||
        m_start_packet.app_image_size > DFU_IMAGE_MAX_SIZE_FULL -
            m_start_packet.bl_image_size - m_start_packet.sd_image_size)
    {
        return NRF_ERROR_DATA_SIZE;
    }

    m_image_size = m_start_packet.sd_image_size + m_start_packet.bl_image_size +
                   m_start_packet.app_image_size;

    if (IS_UPDATING_SD(m_start_packet))
    {
        m_functions.prepare  = dfu_prepare_func_app_erase;
        m_functions.cleared  = dfu_cleared_func_app;
        m_functions.activate = dfu_activate_sd;
    }
    else
    {
        if (m_image_size > DFU_IMAGE_MAX_SIZE_BANKED)
        {
            return NRF_ERROR_DATA_SIZE;
        }

        m_functions.prepare = dfu_prepare_func_swap_erase;
        m_functions.cleared = dfu_cleared_func_swap;
        if (IS_UPDATING_BL(m_start_packet))
        {
            m_functions.activate = dfu_activate_bl;
        }
        else
        {
            m_functions.activate = dfu_activate_app;
        }
    }

    // Valid peer activity detected. Hence restart the DFU timer.
    err_code = dfu_timer_restart();
    VERIFY_SUCCESS(err_code);

#ifdef SIGNED_FW
    if ( is_ota() )
    {
        // The START tuple is not authenticated by the Legacy DFU protocol.
        // BLE can defer preparation until the signed INIT packet is verified.
        m_dfu_state = DFU_STATE_RDY;
        if (m_data_pkt_cb != NULL)
        {
            m_data_pkt_cb(START_PACKET, NRF_SUCCESS, NULL);
        }
    }
    else
#endif
    {
        // Unsigned DFU has no later authentication gate. Serial hosts also
        // require this ordering because they wait for erase after START.
        m_functions.prepare(m_image_size);
    }

    return NRF_SUCCESS;
}


uint32_t dfu_data_pkt_handle(dfu_update_packet_t * p_packet)
{
    uint32_t   data_length;
    uint32_t   err_code;
    uint32_t * p_data;

    VERIFY_PARAM_NOT_NULL(p_packet);

    // Check pointer alignment.
    if (!is_word_aligned(p_packet->params.data_packet.p_data_packet))
    {
        // The p_data_packet is not word aligned address.
        return NRF_ERROR_INVALID_ADDR;
    }

    switch (m_dfu_state)
    {
        case DFU_STATE_RDY:
        case DFU_STATE_RX_INIT_PKT:
            return NRF_ERROR_INVALID_STATE;

        case DFU_STATE_RX_DATA_PKT:
            if ((m_data_received > m_image_size) ||
                (p_packet->params.data_packet.packet_length >
                 ((m_image_size - m_data_received) / sizeof(uint32_t))))
            {
                // The caller is trying to write more bytes into the flash than the size provided to
                // the dfu_image_size_set function. This is treated as a serious error condition and
                // an unrecoverable one. Hence point the variable mp_app_write_address to the top of
                // the flash area. This will ensure that all future application data packet writes
                // will be blocked because of the above check.
                m_data_received = 0xFFFFFFFF;

                return NRF_ERROR_DATA_SIZE;
            }

